Autodesk.Revit.DB.Structure.ConnectionInputPointInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.ConnectionInputPointInfo.RestrictionType
A type of input point restriction.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Structure.ConnectionInputPointInfo.InputMemberIndex
A index of the input member to which the restriction applies.
Since:
2021

Autodesk.Revit.DB.Structure.ConnectionInputPointInfo.PointSelectionText
A string used to select input point by some connections.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Structure.ConnectionInputPointInfo.#ctor(System.String,System.Int32,System.String)
Construct an input point info.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Structure.ConnectionInputPointInfo.#ctor
Construct a default input point.
Since:
2021

Autodesk.Revit.DB.Structure.ConnectionInputPointInfo
An object that holds description information about a connection input point
Since:
2021